# BoltSpacing Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionCSlopedFlange..::..BoltSpacing Property
StructuralSectionCSlopedFlange Class See Also
---
Standard bolt spacing, in. (mm)
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double BoltSpacing { get; set; }
```

Visual Basic
---
```text
Public Property BoltSpacing As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BoltSpacing {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionCSlopedFlange Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace